app/views/chats/show.html.erb

  <div id="messages">
      <% @chat.messages.each do |message| %>
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 1