app/views/apps/show.html.erb

<table>
<% @app.chats.each do |chat| %>
---
SELECT `chats`.* FROM `chats` WHERE `chats`.`app_id` = 1