app/controllers/apps_controller.rb

    def index
      @apps = App.all
---
SELECT `apps`.* FROM `apps`

    def show
      @app = App.find_by(access_token: params["id"])  # /show (id)
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`access_token` = 'XQkheKvqEYYjgNPh9tC14j7H' LIMIT 1

    def create
      @app = App.new(app_params)
      if @app.save
---
INSERT INTO `apps` (`name`, `access_token`, `chats_count`, `created_at`, `updated_at`) VALUES ('school', 'XQkheKvqEYYjgNPh9tC14j7H', NULL, '2022-01-28 13:51:06.581978', '2022-01-28 13:51:06.581978')

    def edit
        @app = App.find_by(access_token: params[:id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`access_token` = 'XQkheKvqEYYjgNPh9tC14j7H' LIMIT 1

    def update
        @app = App.find(params[:id])
        if @app.update(app_params)
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 LIMIT 1
UPDATE `apps` SET `apps`.`name` = 'home', `apps`.`updated_at` = '2022-01-28 17:30:17.734487' WHERE `apps`.`id` = 1