app/controllers/chats_controller.rb

    def create
        @app = App.find(params[:app_id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 LIMIT 1

    def show
        @app = App.find_by(access_token: params[:app_id])
        @chat = @app.chats.find_by(chat_no: params[:id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`access_token` = 'XQkheKvqEYYjgNPh9tC14j7H' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`app_id` = 1 AND `chats`.`chat_no` = 1 LIMIT 1