app/controllers/messages_controller.rb

SELECT `apps`.* FROM `apps` WHERE `apps`.`access_token` = 'XQkheKvqEYYjgNPh9tC14j7H' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`app_id` = 1 AND `chats`.`chat_no` IS NULL LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 2
---
    def index
      @q = params.fetch(:search_query)
    if(@q)
      @app = App.find_by(access_token: params[:app_id])
      @chat = @app.chats.find_by(chat_no: params[:chat_id])
      @ret = @chat.messages
      @messages_match = @ret.search(@q , fields: ['body'], where: {chat_id: @chat.id})

SELECT `chats`.* FROM `chats` WHERE `chats`.`id` = 3 LIMIT 1
---
      def create
          @chat = Chat.find(params[:chat_id])