app/jobs/create_chat_job.rb

  def perform(app)
    # Do something later
        @mx = app.chats.maximum("chat_no")
        if @mx
            @mx = @mx+1
        else
            @mx = 1
        end
        @chat = app.chats.new(chat_no: @mx)

        if @chat.save
---
SELECT MAX(`chats`.`chat_no`) FROM `chats` WHERE `chats`.`app_id` = 1
INSERT INTO `chats` (`chat_no`, `messages_count`, `app_id`, `created_at`, `updated_at`) VALUES (1, NULL, 1, '2022-01-28 13:51:17.660578', '2022-01-28 13:51:17.660578')