app/jobs/create_message_job.rb

  def perform(chat,message_params)
    # Do something later
        @mx = chat.messages.maximum("message_no")
        if @mx
            @mx = @mx+1
        else
            @mx = 1
        end
        @message = chat.messages.new(message_no: @mx, body: message_params["body"])

        if @message.save
---
SELECT MAX(`messages`.`message_no`) FROM `messages` WHERE `messages`.`chat_id` = 1
INSERT INTO `messages` (`message_no`, `body`, `chat_id`, `created_at`, `updated_at`) VALUES (1, 'ahmed', 1, '2022-01-28 13:51:26.925942', '2022-01-28 13:51:26.925942')